In [174]:
import numpy as np
import pandas as pd

In [175]:
#loading data
df=pd.read_csv("C://Users//jesna//Desktop//Elevate Labs//marketing_campaign.csv", sep="\t")

In [176]:
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [177]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [178]:
# checking for null values
df.isnull()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2236,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2237,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2238,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2239,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [247]:
#checking null values
df.isnull().sum()

ID                       0
year_birth               0
education                0
marital_status           0
income                   0
kidhome                  0
teenhome                 0
dt_customer              0
recency                  0
mnt_wines                0
mnt_fruits               0
mnt_meat_products        0
mnt_fish_products        0
mnt_sweet_products       0
mnt_gold_prods           0
num_deals_purchases      0
num_web_purchases        0
num_catalog_purchases    0
num_store_purchases      0
num_web_visits_month     0
accepted_cmp3            0
accepted_cmp4            0
accepted_cmp5            0
accepted_cmp1            0
accepted_cmp2            0
complain                 0
z_cost_contact           0
z_revenue                0
response                 0
age                      0
total_spent              0
dtype: int64

In [180]:
df.isnull().values.any()

True

In [181]:
#see rows containing null values
df[df.isnull().any(axis=1)]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
10,1994,1983,Graduation,Married,NaN,1,0,15-11-2013,11,5,...,7,0,0,0,0,0,0,3,11,0
27,5255,1986,Graduation,Single,NaN,1,0,20-02-2013,19,5,...,1,0,0,0,0,0,0,3,11,0
43,7281,1959,PhD,Single,NaN,0,0,05-11-2013,80,81,...,2,0,0,0,0,0,0,3,11,0
48,7244,1951,Graduation,Single,NaN,2,1,01-01-2014,96,48,...,6,0,0,0,0,0,0,3,11,0
58,8557,1982,Graduation,Single,NaN,1,0,17-06-2013,57,11,...,6,0,0,0,0,0,0,3,11,0
71,10629,1973,2n Cycle,Married,NaN,1,0,14-09-2012,25,25,...,8,0,0,0,0,0,0,3,11,0
90,8996,1957,PhD,Married,NaN,2,1,19-11-2012,4,230,...,9,0,0,0,0,0,0,3,11,0
91,9235,1957,Graduation,Single,NaN,1,1,27-05-2014,45,7,...,7,0,0,0,0,0,0,3,11,0
92,5798,1973,Master,Together,NaN,0,0,23-11-2013,87,445,...,1,0,0,0,0,0,0,3,11,0
128,8268,1961,PhD,Married,NaN,0,1,11-07-2013,23,352,...,6,0,0,0,0,0,0,3,11,0
133,1295,1963,Graduation,Married,NaN,0,1,11-08-2013,96,231,...,4,0,0,0,0,0,0,3,11,0
312,2437,1989,Graduation,Married,NaN,0,0,03-06-2013,69,861,...,3,0,1,0,1,0,0,3,11,0
319,2863,1970,Graduation,Single,NaN,1,2,23-08-2013,67,738,...,7,0,1,0,1,0,0,3,11,0
1379,10475,1970,Master,Together,NaN,0,1,01-04-2013,39,187,...,5,0,0,0,0,0,0,3,11,0
1382,2902,1958,Graduation,Together,NaN,1,1,03-09-2012,87,19,...,5,0,0,0,0,0,0,3,11,0
1383,4345,1964,2n Cycle,Single,NaN,1,1,12-01-2014,49,5,...,7,0,0,0,0,0,0,3,11,0
1386,3769,1972,PhD,Together,NaN,1,0,02-03-2014,17,25,...,7,0,0,0,0,0,0,3,11,0
2059,7187,1969,Master,Together,NaN,1,1,18-05-2013,52,375,...,3,0,0,0,0,0,0,3,11,0
2061,1612,1981,PhD,Single,NaN,1,0,31-05-2013,82,23,...,6,0,0,0,0,0,0,3,11,0
2078,5079,1971,Graduation,Married,NaN,1,1,03-03-2013,82,71,...,8,0,0,0,0,0,0,3,11,0
2079,10339,1954,Master,Together,NaN,0,1,23-06-2013,83,161,...,6,0,0,0,0,0,0,3,11,0
2081,3117,1955,Graduation,Single,NaN,0,1,18-10-2013,95,264,...,7,0,0,0,0,0,0,3,11,0
2084,5250,1943,Master,Widow,NaN,0,0,30-10-2013,75,532,...,1,0,0,1,0,0,0,3,11,1
2228,8720,1978,2n Cycle,Together,NaN,0,0,12-08-2012,53,32,...,0,0,1,0,0,0,0,3,11,0

In [182]:
#fill missing values with median
df["Income"]= df["Income"].fillna(df["Income"].median())

In [183]:
df.isnull().sum()

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

In [184]:
#no duplicates found in the dataset
df.duplicated().sum()

0

In [185]:
df[df.duplicated()]

Empty DataFrame
Columns: [ID, Year_Birth, Education, Marital_Status, Income, Kidhome, Teenhome, Dt_Customer, Recency, MntWines, MntFruits, MntMeatProducts, MntFishProducts, MntSweetProducts, MntGoldProds, NumDealsPurchases, NumWebPurchases, NumCatalogPurchases, NumStorePurchases, NumWebVisitsMonth, AcceptedCmp3, AcceptedCmp4, AcceptedCmp5, AcceptedCmp1, AcceptedCmp2, Complain, Z_CostContact, Z_Revenue, Response]
Index: []

[0 rows x 29 columns]

In [186]:
df.duplicated(subset=["ID"]).sum()

0

In [187]:
df.shape

(2240, 29)

In [188]:
df["Marital_Status"].unique

<bound method Series.unique of 0         Single
1         Single
2       Together
3       Together
4        Married
          ...
2235     Married
2236    Together
2237    Divorced
2238    Together
2239     Married
Name: Marital_Status, Length: 2240, dtype: object>

In [189]:
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'],
      dtype='object')

In [190]:
df["Education"].unique()

array(['Graduation', 'PhD', 'Master', 'Basic', '2n Cycle'], dtype=object)

In [191]:
#Standardizing text values
df["Education"] = df["Education"].str.lower().str.strip()
df["Education"].unique()

array(['graduation', 'phd', 'master', 'basic', '2n cycle'], dtype=object)

In [192]:
df["Marital_Status"].unique()

array(['Single', 'Together', 'Married', 'Divorced', 'Widow', 'Alone',
       'Absurd', 'YOLO'], dtype=object)

In [193]:
#Standardizing text values
df["Marital_Status"]=df["Marital_Status"].str.lower().str.strip()
df["Marital_Status"].unique()

array(['single', 'together', 'married', 'divorced', 'widow', 'alone',
       'absurd', 'yolo'], dtype=object)

In [194]:
#Grouping into meaningful categories
df["Marital_Status"]= df["Marital_Status"].replace({
    "alone" : "single",
    "absurd" : "single",
    "yolo" : "single"
    
})

In [195]:
df["Marital_Status"].unique()

array(['single', 'together', 'married', 'divorced', 'widow'], dtype=object)

In [196]:
#Convert date formats to a consistent type
df["Dt_Customer"] = pd.to_datetime(df["Dt_Customer"], dayfirst=True)

In [197]:
df["Dt_Customer"].head()

0   2012-09-04
1   2014-03-08
2   2013-08-21
3   2014-02-10
4   2014-01-19
Name: Dt_Customer, dtype: datetime64[ns]

In [223]:
#Rename column headers to be clean and uniform
df.columns = (
    df.columns
    .str.replace(r'([A-Z])', r'_\1', regex=True)
    .str.lower()
    .str.strip("_")
)
df.columns

Index(['i_d', 'year__birth', 'education', 'marital__status', 'income',
       'kidhome', 'teenhome', 'dt__customer', 'recency', 'mnt_wines',
       'mnt_fruits', 'mnt_meat_products', 'mnt_fish_products',
       'mnt_sweet_products', 'mnt_gold_prods', 'num_deals_purchases',
       'num_web_purchases', 'num_catalog_purchases', 'num_store_purchases',
       'num_web_visits_month', 'accepted_cmp3', 'accepted_cmp4',
       'accepted_cmp5', 'accepted_cmp1', 'accepted_cmp2', 'complain',
       'z__cost_contact', 'z__revenue', 'response'],
      dtype='object')

In [225]:
df.columns = df.columns.str.replace("__", "_")

In [227]:
df.columns

Index(['i_d', 'year_birth', 'education', 'marital_status', 'income', 'kidhome',
       'teenhome', 'dt_customer', 'recency', 'mnt_wines', 'mnt_fruits',
       'mnt_meat_products', 'mnt_fish_products', 'mnt_sweet_products',
       'mnt_gold_prods', 'num_deals_purchases', 'num_web_purchases',
       'num_catalog_purchases', 'num_store_purchases', 'num_web_visits_month',
       'accepted_cmp3', 'accepted_cmp4', 'accepted_cmp5', 'accepted_cmp1',
       'accepted_cmp2', 'complain', 'z_cost_contact', 'z_revenue', 'response'],
      dtype='object')

In [229]:
df = df.rename(columns={"i_d": "ID"})

In [231]:
df.columns

Index(['ID', 'year_birth', 'education', 'marital_status', 'income', 'kidhome',
       'teenhome', 'dt_customer', 'recency', 'mnt_wines', 'mnt_fruits',
       'mnt_meat_products', 'mnt_fish_products', 'mnt_sweet_products',
       'mnt_gold_prods', 'num_deals_purchases', 'num_web_purchases',
       'num_catalog_purchases', 'num_store_purchases', 'num_web_visits_month',
       'accepted_cmp3', 'accepted_cmp4', 'accepted_cmp5', 'accepted_cmp1',
       'accepted_cmp2', 'complain', 'z_cost_contact', 'z_revenue', 'response'],
      dtype='object')

In [233]:
#Check and fix data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID                     2240 non-null   int64
 1   year_birth             2240 non-null   int64
 2   education              2240 non-null   object
 3   marital_status         2240 non-null   object
 4   income                 2240 non-null   float64
 5   kidhome                2240 non-null   int64
 6   teenhome               2240 non-null   int64
 7   dt_customer            2240 non-null   datetime64[ns]
 8   recency                2240 non-null   int64
 9   mnt_wines              2240 non-null   int64
 10  mnt_fruits             2240 non-null   int64
 11  mnt_meat_products      2240 non-null   int64
 12  mnt_fish_products      2240 non-null   int64
 13  mnt_sweet_products     2240 non-null   int64
 14  mnt_gold_prods         2240 non-null   int64
 15  num_deals_purchases    2240 non-null   int64
 16  num_web_purchases      2240 non-null   int64
 17  num_catalog_purchases  2240 non-null   int64
 18  num_store_purchases    2240 non-null   int64
 19  num_web_visits_month   2240 non-null   int64
 20  accepted_cmp3          2240 non-null   int64
 21  accepted_cmp4          2240 non-null   int64
 22  accepted_cmp5          2240 non-null   int64
 23  accepted_cmp1          2240 non-null   int64
 24  accepted_cmp2          2240 non-null   int64
 25  complain               2240 non-null   int64
 26  z_cost_contact         2240 non-null   int64
 27  z_revenue              2240 non-null   int64
 28  response               2240 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(25), object(2)
memory usage: 507.6+ KB

In [235]:
#creating an age column
df["age"] = pd.Timestamp.today().year - df["year_birth"]

In [237]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 30 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID                     2240 non-null   int64
 1   year_birth             2240 non-null   int64
 2   education              2240 non-null   object
 3   marital_status         2240 non-null   object
 4   income                 2240 non-null   float64
 5   kidhome                2240 non-null   int64
 6   teenhome               2240 non-null   int64
 7   dt_customer            2240 non-null   datetime64[ns]
 8   recency                2240 non-null   int64
 9   mnt_wines              2240 non-null   int64
 10  mnt_fruits             2240 non-null   int64
 11  mnt_meat_products      2240 non-null   int64
 12  mnt_fish_products      2240 non-null   int64
 13  mnt_sweet_products     2240 non-null   int64
 14  mnt_gold_prods         2240 non-null   int64
 15  num_deals_purchases    2240 non-null   int64
 16  num_web_purchases      2240 non-null   int64
 17  num_catalog_purchases  2240 non-null   int64
 18  num_store_purchases    2240 non-null   int64
 19  num_web_visits_month   2240 non-null   int64
 20  accepted_cmp3          2240 non-null   int64
 21  accepted_cmp4          2240 non-null   int64
 22  accepted_cmp5          2240 non-null   int64
 23  accepted_cmp1          2240 non-null   int64
 24  accepted_cmp2          2240 non-null   int64
 25  complain               2240 non-null   int64
 26  z_cost_contact         2240 non-null   int64
 27  z_revenue              2240 non-null   int64
 28  response               2240 non-null   int64
 29  age                    2240 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(26), object(2)
memory usage: 525.1+ KB

In [239]:
df.head()

,ID,year_birth,education,marital_status,income,kidhome,teenhome,dt_customer,recency,mnt_wines,...,accepted_cmp3,accepted_cmp4,accepted_cmp5,accepted_cmp1,accepted_cmp2,complain,z_cost_contact,z_revenue,response,age
0,5524,1957,graduation,single,58138.0,0,0,2012-09-04,58,635,...,0,0,0,0,0,0,3,11,1,69
1,2174,1954,graduation,single,46344.0,1,1,2014-03-08,38,11,...,0,0,0,0,0,0,3,11,0,72
2,4141,1965,graduation,together,71613.0,0,0,2013-08-21,26,426,...,0,0,0,0,0,0,3,11,0,61
3,6182,1984,graduation,together,26646.0,1,0,2014-02-10,26,11,...,0,0,0,0,0,0,3,11,0,42
4,5324,1981,phd,married,58293.0,1,0,2014-01-19,94,173,...,0,0,0,0,0,0,3,11,0,45

In [241]:
#creating total_spent column for better analysis
df["total_spent"] = (
    df["mnt_wines"]
    + df["mnt_fruits"]
    + df["mnt_meat_products"]
    + df["mnt_fish_products"]
    + df["mnt_sweet_products"]
    + df["mnt_gold_prods"]
)

In [243]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 31 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID                     2240 non-null   int64
 1   year_birth             2240 non-null   int64
 2   education              2240 non-null   object
 3   marital_status         2240 non-null   object
 4   income                 2240 non-null   float64
 5   kidhome                2240 non-null   int64
 6   teenhome               2240 non-null   int64
 7   dt_customer            2240 non-null   datetime64[ns]
 8   recency                2240 non-null   int64
 9   mnt_wines              2240 non-null   int64
 10  mnt_fruits             2240 non-null   int64
 11  mnt_meat_products      2240 non-null   int64
 12  mnt_fish_products      2240 non-null   int64
 13  mnt_sweet_products     2240 non-null   int64
 14  mnt_gold_prods         2240 non-null   int64
 15  num_deals_purchases    2240 non-null   int64
 16  num_web_purchases      2240 non-null   int64
 17  num_catalog_purchases  2240 non-null   int64
 18  num_store_purchases    2240 non-null   int64
 19  num_web_visits_month   2240 non-null   int64
 20  accepted_cmp3          2240 non-null   int64
 21  accepted_cmp4          2240 non-null   int64
 22  accepted_cmp5          2240 non-null   int64
 23  accepted_cmp1          2240 non-null   int64
 24  accepted_cmp2          2240 non-null   int64
 25  complain               2240 non-null   int64
 26  z_cost_contact         2240 non-null   int64
 27  z_revenue              2240 non-null   int64
 28  response               2240 non-null   int64
 29  age                    2240 non-null   int64
 30  total_spent            2240 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(27), object(2)
memory usage: 542.6+ KB

In [245]:
df.head()

,ID,year_birth,education,marital_status,income,kidhome,teenhome,dt_customer,recency,mnt_wines,...,accepted_cmp4,accepted_cmp5,accepted_cmp1,accepted_cmp2,complain,z_cost_contact,z_revenue,response,age,total_spent
0,5524,1957,graduation,single,58138.0,0,0,2012-09-04,58,635,...,0,0,0,0,0,3,11,1,69,1617
1,2174,1954,graduation,single,46344.0,1,1,2014-03-08,38,11,...,0,0,0,0,0,3,11,0,72,27
2,4141,1965,graduation,together,71613.0,0,0,2013-08-21,26,426,...,0,0,0,0,0,3,11,0,61,776
3,6182,1984,graduation,together,26646.0,1,0,2014-02-10,26,11,...,0,0,0,0,0,3,11,0,42,53
4,5324,1981,phd,married,58293.0,1,0,2014-01-19,94,173,...,0,0,0,0,0,3,11,0,45,422